Tekla Open API Reference for Tekla Structures 2025
PolyLine.Length Method
 Returns the length of a polyline.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Length()
Public Function Length As Double
Return Value
Type: Double
The length of the polyline.
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace